import 'package:geek_plants/values/pathStrings.dart';

import '../model/plant.dart';

List categories = [
  "Все",
  "Комнатные",
  "Уличные",
  "Цветущие",
  "Однолетние",
  "Многолетние"
];
List plantList = [
  Plant(
      name: "Абутилон (Катаника)",
      latName: "лат.Abutilon",
      photoPath: abutilonPath,
      description:
          "Абутилон — это неприхотливое и обильноцветущее комнатное растение. Это растение относится к семейству мальвовые. Его ближайшие «родственники» — гибискус и всем известная садовая шток-роза (мальва)."),
  Plant(
      name: "Агава",
      latName: "лат.Agave",
      photoPath: abutilonPath,
      description:
          "Абутилон — это неприхотливое и обильноцветущее комнатное растение. Это растение относится к семейству мальвовые. Его ближайшие «родственники» — гибискус и всем известная садовая шток-роза (мальва)."),
  Plant(
    name: "Бальзамин",
    latName: "лат.Impatience",
    photoPath: abutilonPath,
    description:
        "Абутилон — это неприхотливое и обильноцветущее комнатное растение. Это растение относится к семейству мальвовые. Его ближайшие «родственники» — гибискус и всем известная садовая шток-роза (мальва).",
  ),
  Plant(
    name: "Бальзамин",
    latName: "лат.Impatience",
    photoPath: abutilonPath,
    description:
        "Абутилон — это неприхотливое и обильноцветущее комнатное растение. Это растение относится к семейству мальвовые. Его ближайшие «родственники» — гибискус и всем известная садовая шток-роза (мальва).",
  ),
  Plant(
    name: "Бальзамин",
    latName: "лат.Impatience",
    photoPath: abutilonPath,
    description:
        "Абутилон — это неприхотливое и обильноцветущее комнатное растение. Это растение относится к семейству мальвовые. Его ближайшие «родственники» — гибискус и всем известная садовая шток-роза (мальва).",
  ),
  Plant(
    name: "Бальзамин",
    latName: "лат.Impatience",
    photoPath: abutilonPath,
    description:
        "Абутилон — это неприхотливое и обильноцветущее комнатное растение. Это растение относится к семейству мальвовые. Его ближайшие «родственники» — гибискус и всем известная садовая шток-роза (мальва).",
  ),
  Plant(
    name: "Бальзамин",
    latName: "лат.Impatience",
    photoPath: abutilonPath,
    description:
        "Абутилон — это неприхотливое и обильноцветущее комнатное растение. Это растение относится к семейству мальвовые. Его ближайшие «родственники» — гибискус и всем известная садовая шток-роза (мальва).",
  ),
];
