final String hintEmail = 'E-mail';
final String hintPassword = 'Пароль';
final String forgetPassword =  'Забыли пароль?';
final String register =  'Зарегистрироваться';
final String signIn =  'Войти';

///main screen
final openCalendarButton = 'Календарь ухода';

///todo убрать после получения реального пользователя
final  testUserName = 'Мария Кудрявцева';

///calendar events screen
final taskListTitle = 'Список задач';
final taskRemaining = 'Осталось задач: ';
final uncompleteTasks = 'Невыполненные задачи:';
final completeTaskHeader = 'Выполнено: ';

///calendar screen
final calendarTitleScreen = 'Календарь ухода';

final String light = 'Свет';

/// mock texts
final String lightDescription =
    "Растение светолюбиво, предпочитает прямой солнечный свет в течение нескольких часов в день утром или вечером. Зимой растение также нуждается в хорошем освещении. Лучшие место для комнатного клена - в непосредственной близости южного окна.";
final String temperature = 'Температура';
final String temperatureDescription =
    "Летом оптимальная температура для абутилона в пределах 22-25°С. Зимой - 12-15°С. При более низкой температуре может сбросить листья. Эта неприятность случается и от холодных сквозняков.";
final String humidity = "Влажность воздуха";
final String humidityDescription =
    "Абутилоны не слишком требовательные к влажности воздуха, но при слишком теплом и сухом воздухе в помещении зимой листья подсыхают и скручиваются.Полезно периодическое опрыскивание или использование увлажнителей воздуха.";
final String soil = "Почва";
final String soilDescription =
    " Абутилоны любят плодородную и рыхлую, хорошо пропускающую воду, почву. Подходит смесь дерновой, перегнойной, листовой земли и песка, можно использовать готовый субстрат для пальм.";
final String trim = "Обрезка";
final String trimDescription =
    "Абутилон растет быстро. Осенью или ранней весной побеги наполовину укорачивают. Если их не обрезать, то за один сезон комнатный клен вырастет до 1,5 метра в высоту. В течение вегетационного периода рекомендуют обрезать слабые побеги.";
final String propagation = "Размножение";
final String propagationDescription =
    "Размножать абутилоны не сложно, обычно их размножают черенкованием.  Сорта абутилона с зелеными листьями размножают семенами и черенками; пестролистные сорта — только черенками.";
final String diseasesAndPests = "Болезни и вредители";
final String diseasesAndPestsDescription =
    "Абутилоны часто поражаются тлей, белокрылкой, паутинным клещом, мучнистым червецом, щитовкой. привлекательные для вредителей – тли, белокрылки, щитовки. Бороться с ними можно при помощи химических препаратов. Инсектициды для комнатных растений продаются в каждом цветочном магазине, обрабатывать по инструкции. Комнатные цветы лучше себя чувствуют в более влажном воздухе, поэтому это тоже следует учитывать.";
final String careProblems = "Возможные проблемы в уходе";
final String careProblemsDescription = """Обычно сигналят от проблемах листья:\n
Опадают – резкий перепад температуры, сквозняк, пересушивание или переувлажнение земляного кома.\n
Сухие коричневые кончики  - слишком сухой воздух в помещении или недостаток полива.\n
Вянут - пересыхание почвы.\n
Пожелтение, а потом опадение  – высокая температура или сухость воздуха.\n
Стебли вытягиваются, листья бледнеют и тускнеют - недостаток света.\n
Края листьев скручиваются, а верхушки засыхают - слишком яркий свет и сухой воздух.\n
Желтеют и покрываются пятнами – недостаток питательных веществ в почве.""";



